Revit 2025 API
LabelUtils.GetStructuralSectionShapeName Method
 Gets the user-visible name for a StructuralSectionShape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static string GetStructuralSectionShapeName(
	StructuralSectionShape shape
)
Public Shared Function GetStructuralSectionShapeName (
	shape As StructuralSectionShape
) As String
public:
static String^ GetStructuralSectionShapeName(
	StructuralSectionShape shape
)
static member GetStructuralSectionShapeName :
        shape : StructuralSectionShape -> string
Parameters
shape StructuralSectionShape
 The StructuralSectionShape to get the user-visible name.
Return Value
String
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
LabelUtils Class
Autodesk.Revit.DB Namespace